IntegrationHub.Api/TestData/KSIP/template_REQUEST.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:spr="http://policja.gov.pl/RuchDrogowy/SprawdzenieOsoby">
   <soapenv:Header/>
   <soapenv:Body>
      <spr:SprawdzenieOsobyRequest>
         <spr:RequestHeader>
            <spr:RequestID>?</spr:RequestID>
            <spr:Timestamp>?</spr:Timestamp>
            <spr:AuditRecord>
               <spr:SystemName>?</spr:SystemName>
               <!--Optional:-->
               <spr:ApplicationName>?</spr:ApplicationName>
               <!--Optional:-->
               <spr:ModuleName>?</spr:ModuleName>
               <!--Optional:-->
               <spr:TerminalName>?</spr:TerminalName>
               <!--Optional:-->
               <spr:UserProfile>
                  <!--Optional:-->
                  <spr:UserID>?</spr:UserID>
                  <!--Optional:-->
                  <spr:UnitID>?</spr:UnitID>
               </spr:UserProfile>
            </spr:AuditRecord>
         </spr:RequestHeader>
         <spr:RequestBody>
            <!--You have a CHOICE of the next 2 items at this level-->
            <spr:NrPESEL>?</spr:NrPESEL>
            <spr:Person>
               <spr:PersonName>
                  <spr:FirstName>?</spr:FirstName>
                  <spr:LastName>?</spr:LastName>
               </spr:PersonName>
               <spr:BirthDate>?</spr:BirthDate>
            </spr:Person>
         </spr:RequestBody>
      </spr:SprawdzenieOsobyRequest>
   </soapenv:Body>
</soapenv:Envelope>